app/Controllers/Admin/Produk.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new ProdukModel();
        $data['products'] = $model->findAll();