app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `full_name` = 'Admin Utama'
OR `email` = 'Admin Utama'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();

        $full_name = $this->request->getPost('full_name');
        $password_hash = $this->request->getPost('password_hash');

        $user = $userModel->where('full_name', $full_name)
                        ->orWhere('email', $full_name)
                        ->first();